output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.8s), 0015/1000 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 0015/1000 VUs  0m00.8s/3m00.0s

running (0m01.8s), 0031/1000 VUs, 20 complete and 0 interrupted iterations
default   [   1% ] 0031/1000 VUs  0m01.8s/3m00.0s

running (0m02.8s), 0048/1000 VUs, 46 complete and 0 interrupted iterations
default   [   2% ] 0048/1000 VUs  0m02.8s/3m00.0s

running (0m03.8s), 0065/1000 VUs, 74 complete and 0 interrupted iterations
default   [   2% ] 0065/1000 VUs  0m03.8s/3m00.0s

running (0m04.8s), 0081/1000 VUs, 100 complete and 0 interrupted iterations
default   [   3% ] 0081/1000 VUs  0m04.8s/3m00.0s

running (0m05.8s), 0098/1000 VUs, 129 complete and 0 interrupted iterations
default   [   3% ] 0098/1000 VUs  0m05.8s/3m00.0s

running (0m06.8s), 0114/1000 VUs, 163 complete and 0 interrupted iterations
default   [   4% ] 0114/1000 VUs  0m06.8s/3m00.0s

running (0m07.8s), 0131/1000 VUs, 186 complete and 0 interrupted iterations
default   [   4% ] 0131/1000 VUs  0m07.8s/3m00.0s

running (0m08.8s), 0148/1000 VUs, 202 complete and 0 interrupted iterations
default   [   5% ] 0148/1000 VUs  0m08.8s/3m00.0s

running (0m09.8s), 0164/1000 VUs, 225 complete and 0 interrupted iterations
default   [   5% ] 0164/1000 VUs  0m09.8s/3m00.0s

running (0m10.8s), 0181/1000 VUs, 257 complete and 0 interrupted iterations
default   [   6% ] 0181/1000 VUs  0m10.8s/3m00.0s

running (0m11.8s), 0198/1000 VUs, 285 complete and 0 interrupted iterations
default   [   7% ] 0198/1000 VUs  0m11.8s/3m00.0s

running (0m12.8s), 0214/1000 VUs, 317 complete and 0 interrupted iterations
default   [   7% ] 0214/1000 VUs  0m12.8s/3m00.0s

running (0m13.8s), 0231/1000 VUs, 346 complete and 0 interrupted iterations
default   [   8% ] 0231/1000 VUs  0m13.8s/3m00.0s

running (0m14.8s), 0248/1000 VUs, 371 complete and 0 interrupted iterations
default   [   8% ] 0248/1000 VUs  0m14.8s/3m00.0s

running (0m15.8s), 0264/1000 VUs, 395 complete and 0 interrupted iterations
default   [   9% ] 0264/1000 VUs  0m15.8s/3m00.0s

running (0m16.9s), 0281/1000 VUs, 426 complete and 0 interrupted iterations
default   [   9% ] 0281/1000 VUs  0m16.9s/3m00.0s

running (0m17.8s), 0298/1000 VUs, 460 complete and 0 interrupted iterations
default   [  10% ] 0298/1000 VUs  0m17.8s/3m00.0s

running (0m18.8s), 0314/1000 VUs, 489 complete and 0 interrupted iterations
default   [  10% ] 0314/1000 VUs  0m18.8s/3m00.0s

running (0m19.8s), 0331/1000 VUs, 519 complete and 0 interrupted iterations
default   [  11% ] 0331/1000 VUs  0m19.8s/3m00.0s

running (0m20.8s), 0348/1000 VUs, 561 complete and 0 interrupted iterations
default   [  12% ] 0348/1000 VUs  0m20.8s/3m00.0s

running (0m21.8s), 0364/1000 VUs, 599 complete and 0 interrupted iterations
default   [  12% ] 0364/1000 VUs  0m21.8s/3m00.0s

running (0m22.8s), 0381/1000 VUs, 624 complete and 0 interrupted iterations
default   [  13% ] 0381/1000 VUs  0m22.8s/3m00.0s

running (0m23.8s), 0398/1000 VUs, 654 complete and 0 interrupted iterations
default   [  13% ] 0398/1000 VUs  0m23.8s/3m00.0s

running (0m24.8s), 0414/1000 VUs, 688 complete and 0 interrupted iterations
default   [  14% ] 0414/1000 VUs  0m24.8s/3m00.0s

running (0m25.8s), 0431/1000 VUs, 714 complete and 0 interrupted iterations
default   [  14% ] 0431/1000 VUs  0m25.8s/3m00.0s

running (0m26.8s), 0447/1000 VUs, 747 complete and 0 interrupted iterations
default   [  15% ] 0447/1000 VUs  0m26.8s/3m00.0s

running (0m27.8s), 0464/1000 VUs, 774 complete and 0 interrupted iterations
default   [  15% ] 0464/1000 VUs  0m27.8s/3m00.0s

running (0m28.8s), 0481/1000 VUs, 796 complete and 0 interrupted iterations
default   [  16% ] 0481/1000 VUs  0m28.8s/3m00.0s

running (0m29.8s), 0497/1000 VUs, 834 complete and 0 interrupted iterations
default   [  17% ] 0497/1000 VUs  0m29.8s/3m00.0s

running (0m30.8s), 0514/1000 VUs, 871 complete and 0 interrupted iterations
default   [  17% ] 0514/1000 VUs  0m30.8s/3m00.0s

running (0m31.8s), 0531/1000 VUs, 895 complete and 0 interrupted iterations
default   [  18% ] 0531/1000 VUs  0m31.8s/3m00.0s

running (0m32.8s), 0547/1000 VUs, 924 complete and 0 interrupted iterations
default   [  18% ] 0547/1000 VUs  0m32.8s/3m00.0s

running (0m33.8s), 0564/1000 VUs, 960 complete and 0 interrupted iterations
default   [  19% ] 0564/1000 VUs  0m33.8s/3m00.0s

running (0m34.8s), 0581/1000 VUs, 988 complete and 0 interrupted iterations
default   [  19% ] 0581/1000 VUs  0m34.8s/3m00.0s

running (0m35.8s), 0597/1000 VUs, 1020 complete and 0 interrupted iterations
default   [  20% ] 0597/1000 VUs  0m35.8s/3m00.0s

running (0m36.8s), 0614/1000 VUs, 1053 complete and 0 interrupted iterations
default   [  20% ] 0614/1000 VUs  0m36.8s/3m00.0s

running (0m37.8s), 0631/1000 VUs, 1087 complete and 0 interrupted iterations
default   [  21% ] 0631/1000 VUs  0m37.8s/3m00.0s

running (0m38.8s), 0647/1000 VUs, 1116 complete and 0 interrupted iterations
default   [  22% ] 0647/1000 VUs  0m38.8s/3m00.0s

running (0m39.8s), 0664/1000 VUs, 1149 complete and 0 interrupted iterations
default   [  22% ] 0664/1000 VUs  0m39.8s/3m00.0s

running (0m40.8s), 0681/1000 VUs, 1182 complete and 0 interrupted iterations
default   [  23% ] 0681/1000 VUs  0m40.8s/3m00.0s

running (0m41.8s), 0697/1000 VUs, 1205 complete and 0 interrupted iterations
default   [  23% ] 0697/1000 VUs  0m41.8s/3m00.0s

running (0m42.8s), 0714/1000 VUs, 1235 complete and 0 interrupted iterations
default   [  24% ] 0714/1000 VUs  0m42.8s/3m00.0s

running (0m43.8s), 0731/1000 VUs, 1261 complete and 0 interrupted iterations
default   [  24% ] 0731/1000 VUs  0m43.8s/3m00.0s

running (0m44.8s), 0747/1000 VUs, 1301 complete and 0 interrupted iterations
default   [  25% ] 0747/1000 VUs  0m44.8s/3m00.0s

running (0m45.8s), 0764/1000 VUs, 1332 complete and 0 interrupted iterations
default   [  25% ] 0764/1000 VUs  0m45.8s/3m00.0s

running (0m46.8s), 0780/1000 VUs, 1361 complete and 0 interrupted iterations
default   [  26% ] 0780/1000 VUs  0m46.8s/3m00.0s

running (0m47.8s), 0797/1000 VUs, 1391 complete and 0 interrupted iterations
default   [  27% ] 0797/1000 VUs  0m47.8s/3m00.0s

running (0m48.8s), 0814/1000 VUs, 1411 complete and 0 interrupted iterations
default   [  27% ] 0814/1000 VUs  0m48.8s/3m00.0s

running (0m49.8s), 0830/1000 VUs, 1440 complete and 0 interrupted iterations
default   [  28% ] 0830/1000 VUs  0m49.8s/3m00.0s

running (0m50.9s), 0847/1000 VUs, 1471 complete and 0 interrupted iterations
default   [  28% ] 0847/1000 VUs  0m50.8s/3m00.0s

running (0m51.8s), 0864/1000 VUs, 1501 complete and 0 interrupted iterations
default   [  29% ] 0864/1000 VUs  0m51.8s/3m00.0s

running (0m52.8s), 0880/1000 VUs, 1530 complete and 0 interrupted iterations
default   [  29% ] 0880/1000 VUs  0m52.8s/3m00.0s

running (0m53.8s), 0897/1000 VUs, 1558 complete and 0 interrupted iterations
default   [  30% ] 0897/1000 VUs  0m53.8s/3m00.0s

running (0m54.8s), 0914/1000 VUs, 1580 complete and 0 interrupted iterations
default   [  30% ] 0914/1000 VUs  0m54.8s/3m00.0s

running (0m55.8s), 0930/1000 VUs, 1597 complete and 0 interrupted iterations
default   [  31% ] 0930/1000 VUs  0m55.8s/3m00.0s

running (0m56.9s), 0947/1000 VUs, 1614 complete and 0 interrupted iterations
default   [  32% ] 0947/1000 VUs  0m56.9s/3m00.0s

running (0m57.8s), 0964/1000 VUs, 1636 complete and 0 interrupted iterations
default   [  32% ] 0964/1000 VUs  0m57.8s/3m00.0s

running (0m58.8s), 0980/1000 VUs, 1653 complete and 0 interrupted iterations
default   [  33% ] 0980/1000 VUs  0m58.8s/3m00.0s

running (0m59.8s), 0997/1000 VUs, 1680 complete and 0 interrupted iterations
default   [  33% ] 0997/1000 VUs  0m59.8s/3m00.0s

running (1m00.9s), 1000/1000 VUs, 1708 complete and 0 interrupted iterations
default   [  34% ] 1000/1000 VUs  1m00.9s/3m00.0s

running (1m01.8s), 1000/1000 VUs, 1745 complete and 0 interrupted iterations
default   [  34% ] 1000/1000 VUs  1m01.8s/3m00.0s

running (1m02.8s), 1000/1000 VUs, 1771 complete and 0 interrupted iterations
default   [  35% ] 1000/1000 VUs  1m02.8s/3m00.0s

running (1m03.8s), 1000/1000 VUs, 1797 complete and 0 interrupted iterations
default   [  35% ] 1000/1000 VUs  1m03.8s/3m00.0s

running (1m04.8s), 1000/1000 VUs, 1824 complete and 0 interrupted iterations
default   [  36% ] 1000/1000 VUs  1m04.8s/3m00.0s

running (1m05.8s), 1000/1000 VUs, 1853 complete and 0 interrupted iterations
default   [  37% ] 1000/1000 VUs  1m05.8s/3m00.0s

running (1m06.8s), 1000/1000 VUs, 1878 complete and 0 interrupted iterations
default   [  37% ] 1000/1000 VUs  1m06.8s/3m00.0s

running (1m07.8s), 1000/1000 VUs, 1909 complete and 0 interrupted iterations
default   [  38% ] 1000/1000 VUs  1m07.8s/3m00.0s

running (1m08.8s), 1000/1000 VUs, 1949 complete and 0 interrupted iterations
default   [  38% ] 1000/1000 VUs  1m08.8s/3m00.0s

running (1m09.8s), 1000/1000 VUs, 1986 complete and 0 interrupted iterations
default   [  39% ] 1000/1000 VUs  1m09.8s/3m00.0s

running (1m10.8s), 1000/1000 VUs, 2022 complete and 0 interrupted iterations
default   [  39% ] 1000/1000 VUs  1m10.8s/3m00.0s

running (1m11.8s), 1000/1000 VUs, 2063 complete and 0 interrupted iterations
default   [  40% ] 1000/1000 VUs  1m11.8s/3m00.0s

running (1m12.8s), 1000/1000 VUs, 2105 complete and 0 interrupted iterations
default   [  40% ] 1000/1000 VUs  1m12.8s/3m00.0s

running (1m13.8s), 1000/1000 VUs, 2142 complete and 0 interrupted iterations
default   [  41% ] 1000/1000 VUs  1m13.8s/3m00.0s

running (1m14.8s), 1000/1000 VUs, 2169 complete and 0 interrupted iterations
default   [  42% ] 1000/1000 VUs  1m14.8s/3m00.0s

running (1m15.8s), 1000/1000 VUs, 2193 complete and 0 interrupted iterations
default   [  42% ] 1000/1000 VUs  1m15.8s/3m00.0s

running (1m16.8s), 1000/1000 VUs, 2220 complete and 0 interrupted iterations
default   [  43% ] 1000/1000 VUs  1m16.8s/3m00.0s

running (1m17.8s), 1000/1000 VUs, 2246 complete and 0 interrupted iterations
default   [  43% ] 1000/1000 VUs  1m17.8s/3m00.0s

running (1m18.8s), 1000/1000 VUs, 2278 complete and 0 interrupted iterations
default   [  44% ] 1000/1000 VUs  1m18.8s/3m00.0s

running (1m19.8s), 1000/1000 VUs, 2309 complete and 0 interrupted iterations
default   [  44% ] 1000/1000 VUs  1m19.8s/3m00.0s

running (1m20.8s), 1000/1000 VUs, 2339 complete and 0 interrupted iterations
default   [  45% ] 1000/1000 VUs  1m20.8s/3m00.0s

running (1m21.8s), 1000/1000 VUs, 2370 complete and 0 interrupted iterations
default   [  45% ] 1000/1000 VUs  1m21.8s/3m00.0s

running (1m22.8s), 1000/1000 VUs, 2403 complete and 0 interrupted iterations
default   [  46% ] 1000/1000 VUs  1m22.8s/3m00.0s

running (1m23.8s), 1000/1000 VUs, 2436 complete and 0 interrupted iterations
default   [  47% ] 1000/1000 VUs  1m23.8s/3m00.0s

running (1m24.8s), 1000/1000 VUs, 2465 complete and 0 interrupted iterations
default   [  47% ] 1000/1000 VUs  1m24.8s/3m00.0s

running (1m25.8s), 1000/1000 VUs, 2498 complete and 0 interrupted iterations
default   [  48% ] 1000/1000 VUs  1m25.8s/3m00.0s

running (1m26.8s), 1000/1000 VUs, 2523 complete and 0 interrupted iterations
default   [  48% ] 1000/1000 VUs  1m26.8s/3m00.0s

running (1m27.8s), 1000/1000 VUs, 2552 complete and 0 interrupted iterations
default   [  49% ] 1000/1000 VUs  1m27.8s/3m00.0s

running (1m28.8s), 1000/1000 VUs, 2596 complete and 0 interrupted iterations
default   [  49% ] 1000/1000 VUs  1m28.8s/3m00.0s

running (1m29.8s), 1000/1000 VUs, 2636 complete and 0 interrupted iterations
default   [  50% ] 1000/1000 VUs  1m29.8s/3m00.0s

running (1m30.8s), 1000/1000 VUs, 2682 complete and 0 interrupted iterations
default   [  50% ] 1000/1000 VUs  1m30.8s/3m00.0s

running (1m31.8s), 1000/1000 VUs, 2724 complete and 0 interrupted iterations
default   [  51% ] 1000/1000 VUs  1m31.8s/3m00.0s

running (1m32.8s), 1000/1000 VUs, 2768 complete and 0 interrupted iterations
default   [  52% ] 1000/1000 VUs  1m32.8s/3m00.0s

running (1m33.8s), 1000/1000 VUs, 2802 complete and 0 interrupted iterations
default   [  52% ] 1000/1000 VUs  1m33.8s/3m00.0s

running (1m34.8s), 1000/1000 VUs, 2843 complete and 0 interrupted iterations
default   [  53% ] 1000/1000 VUs  1m34.8s/3m00.0s

running (1m35.8s), 1000/1000 VUs, 2868 complete and 0 interrupted iterations
default   [  53% ] 1000/1000 VUs  1m35.8s/3m00.0s

running (1m36.8s), 1000/1000 VUs, 2895 complete and 0 interrupted iterations
default   [  54% ] 1000/1000 VUs  1m36.8s/3m00.0s

running (1m37.8s), 1000/1000 VUs, 2927 complete and 0 interrupted iterations
default   [  54% ] 1000/1000 VUs  1m37.8s/3m00.0s

running (1m38.8s), 1000/1000 VUs, 2966 complete and 0 interrupted iterations
default   [  55% ] 1000/1000 VUs  1m38.8s/3m00.0s

running (1m39.8s), 1000/1000 VUs, 3008 complete and 0 interrupted iterations
default   [  55% ] 1000/1000 VUs  1m39.8s/3m00.0s

running (1m40.8s), 1000/1000 VUs, 3062 complete and 0 interrupted iterations
default   [  56% ] 1000/1000 VUs  1m40.8s/3m00.0s

running (1m41.8s), 1000/1000 VUs, 3109 complete and 0 interrupted iterations
default   [  57% ] 1000/1000 VUs  1m41.8s/3m00.0s

running (1m42.8s), 1000/1000 VUs, 3159 complete and 0 interrupted iterations
default   [  57% ] 1000/1000 VUs  1m42.8s/3m00.0s

running (1m43.8s), 1000/1000 VUs, 3212 complete and 0 interrupted iterations
default   [  58% ] 1000/1000 VUs  1m43.8s/3m00.0s

running (1m44.8s), 1000/1000 VUs, 3256 complete and 0 interrupted iterations
default   [  58% ] 1000/1000 VUs  1m44.8s/3m00.0s

running (1m45.8s), 1000/1000 VUs, 3304 complete and 0 interrupted iterations
default   [  59% ] 1000/1000 VUs  1m45.8s/3m00.0s

running (1m46.8s), 1000/1000 VUs, 3347 complete and 0 interrupted iterations
default   [  59% ] 1000/1000 VUs  1m46.8s/3m00.0s

running (1m47.8s), 1000/1000 VUs, 3380 complete and 0 interrupted iterations
default   [  60% ] 1000/1000 VUs  1m47.8s/3m00.0s

running (1m48.8s), 1000/1000 VUs, 3405 complete and 0 interrupted iterations
default   [  60% ] 1000/1000 VUs  1m48.8s/3m00.0s

running (1m49.8s), 1000/1000 VUs, 3424 complete and 0 interrupted iterations
default   [  61% ] 1000/1000 VUs  1m49.8s/3m00.0s

running (1m50.8s), 1000/1000 VUs, 3441 complete and 0 interrupted iterations
default   [  62% ] 1000/1000 VUs  1m50.8s/3m00.0s

running (1m51.8s), 1000/1000 VUs, 3475 complete and 0 interrupted iterations
default   [  62% ] 1000/1000 VUs  1m51.8s/3m00.0s

running (1m52.8s), 1000/1000 VUs, 3510 complete and 0 interrupted iterations
default   [  63% ] 1000/1000 VUs  1m52.8s/3m00.0s

running (1m53.8s), 1000/1000 VUs, 3541 complete and 0 interrupted iterations
default   [  63% ] 1000/1000 VUs  1m53.8s/3m00.0s

running (1m54.8s), 1000/1000 VUs, 3565 complete and 0 interrupted iterations
default   [  64% ] 1000/1000 VUs  1m54.8s/3m00.0s

running (1m55.8s), 1000/1000 VUs, 3597 complete and 0 interrupted iterations
default   [  64% ] 1000/1000 VUs  1m55.8s/3m00.0s

running (1m56.8s), 1000/1000 VUs, 3610 complete and 0 interrupted iterations
default   [  65% ] 1000/1000 VUs  1m56.8s/3m00.0s

running (1m57.8s), 1000/1000 VUs, 3634 complete and 0 interrupted iterations
default   [  65% ] 1000/1000 VUs  1m57.8s/3m00.0s

running (1m58.8s), 1000/1000 VUs, 3666 complete and 0 interrupted iterations
default   [  66% ] 1000/1000 VUs  1m58.8s/3m00.0s

running (1m59.8s), 1000/1000 VUs, 3718 complete and 0 interrupted iterations
default   [  67% ] 1000/1000 VUs  1m59.8s/3m00.0s

running (2m00.8s), 1000/1000 VUs, 3762 complete and 0 interrupted iterations
default   [  67% ] 1000/1000 VUs  2m00.8s/3m00.0s

running (2m01.8s), 1000/1000 VUs, 3805 complete and 0 interrupted iterations
default   [  68% ] 1000/1000 VUs  2m01.8s/3m00.0s

running (2m02.8s), 0997/1000 VUs, 3844 complete and 0 interrupted iterations
default   [  68% ] 0997/1000 VUs  2m02.8s/3m00.0s

running (2m03.8s), 0997/1000 VUs, 3868 complete and 0 interrupted iterations
default   [  69% ] 0997/1000 VUs  2m03.8s/3m00.0s

running (2m04.8s), 0996/1000 VUs, 3900 complete and 0 interrupted iterations
default   [  69% ] 0996/1000 VUs  2m04.8s/3m00.0s

running (2m05.8s), 0991/1000 VUs, 3938 complete and 0 interrupted iterations
default   [  70% ] 0991/1000 VUs  2m05.8s/3m00.0s

running (2m06.8s), 0987/1000 VUs, 3978 complete and 0 interrupted iterations
default   [  70% ] 0987/1000 VUs  2m06.8s/3m00.0s

running (2m07.8s), 0986/1000 VUs, 4006 complete and 0 interrupted iterations
default   [  71% ] 0986/1000 VUs  2m07.8s/3m00.0s

running (2m08.8s), 0986/1000 VUs, 4040 complete and 0 interrupted iterations
default   [  72% ] 0986/1000 VUs  2m08.8s/3m00.0s

running (2m09.8s), 0984/1000 VUs, 4069 complete and 0 interrupted iterations
default   [  72% ] 0984/1000 VUs  2m09.8s/3m00.0s

running (2m10.8s), 0977/1000 VUs, 4101 complete and 0 interrupted iterations
default   [  73% ] 0977/1000 VUs  2m10.8s/3m00.0s

running (2m11.8s), 0967/1000 VUs, 4162 complete and 0 interrupted iterations
default   [  73% ] 0967/1000 VUs  2m11.8s/3m00.0s

running (2m12.8s), 0948/1000 VUs, 4230 complete and 0 interrupted iterations
default   [  74% ] 0948/1000 VUs  2m12.8s/3m00.0s

running (2m13.8s), 0934/1000 VUs, 4273 complete and 0 interrupted iterations
default   [  74% ] 0934/1000 VUs  2m13.8s/3m00.0s

running (2m14.8s), 0920/1000 VUs, 4315 complete and 0 interrupted iterations
default   [  75% ] 0920/1000 VUs  2m14.8s/3m00.0s

running (2m15.8s), 0903/1000 VUs, 4361 complete and 0 interrupted iterations
default   [  75% ] 0903/1000 VUs  2m15.8s/3m00.0s

running (2m16.8s), 0885/1000 VUs, 4409 complete and 0 interrupted iterations
default   [  76% ] 0885/1000 VUs  2m16.8s/3m00.0s

running (2m17.8s), 0873/1000 VUs, 4449 complete and 0 interrupted iterations
default   [  77% ] 0873/1000 VUs  2m17.8s/3m00.0s

running (2m18.8s), 0864/1000 VUs, 4474 complete and 0 interrupted iterations
default   [  77% ] 0864/1000 VUs  2m18.8s/3m00.0s

running (2m19.8s), 0857/1000 VUs, 4508 complete and 0 interrupted iterations
default   [  78% ] 0857/1000 VUs  2m19.8s/3m00.0s

running (2m20.8s), 0844/1000 VUs, 4552 complete and 0 interrupted iterations
default   [  78% ] 0844/1000 VUs  2m20.8s/3m00.0s

running (2m21.8s), 0836/1000 VUs, 4588 complete and 0 interrupted iterations
default   [  79% ] 0836/1000 VUs  2m21.8s/3m00.0s

running (2m22.8s), 0824/1000 VUs, 4637 complete and 0 interrupted iterations
default   [  79% ] 0824/1000 VUs  2m22.8s/3m00.0s

running (2m23.8s), 0809/1000 VUs, 4673 complete and 0 interrupted iterations
default   [  80% ] 0809/1000 VUs  2m23.8s/3m00.0s

running (2m24.8s), 0791/1000 VUs, 4726 complete and 0 interrupted iterations
default   [  80% ] 0791/1000 VUs  2m24.8s/3m00.0s

running (2m25.8s), 0768/1000 VUs, 4767 complete and 0 interrupted iterations
default   [  81% ] 0768/1000 VUs  2m25.8s/3m00.0s

running (2m26.8s), 0750/1000 VUs, 4802 complete and 0 interrupted iterations
default   [  82% ] 0750/1000 VUs  2m26.8s/3m00.0s

running (2m27.8s), 0742/1000 VUs, 4829 complete and 0 interrupted iterations
default   [  82% ] 0742/1000 VUs  2m27.8s/3m00.0s

running (2m28.8s), 0721/1000 VUs, 4876 complete and 0 interrupted iterations
default   [  83% ] 0721/1000 VUs  2m28.8s/3m00.0s

running (2m29.8s), 0706/1000 VUs, 4921 complete and 0 interrupted iterations
default   [  83% ] 0706/1000 VUs  2m29.8s/3m00.0s

running (2m30.8s), 0687/1000 VUs, 4963 complete and 0 interrupted iterations
default   [  84% ] 0687/1000 VUs  2m30.8s/3m00.0s

running (2m31.8s), 0667/1000 VUs, 5012 complete and 0 interrupted iterations
default   [  84% ] 0667/1000 VUs  2m31.8s/3m00.0s

running (2m32.8s), 0643/1000 VUs, 5065 complete and 0 interrupted iterations
default   [  85% ] 0643/1000 VUs  2m32.8s/3m00.0s

running (2m33.8s), 0628/1000 VUs, 5108 complete and 0 interrupted iterations
default   [  85% ] 0628/1000 VUs  2m33.8s/3m00.0s

running (2m34.8s), 0609/1000 VUs, 5151 complete and 0 interrupted iterations
default   [  86% ] 0609/1000 VUs  2m34.8s/3m00.0s

running (2m35.8s), 0578/1000 VUs, 5203 complete and 0 interrupted iterations
default   [  87% ] 0578/1000 VUs  2m35.8s/3m00.0s

running (2m36.8s), 0553/1000 VUs, 5251 complete and 0 interrupted iterations
default   [  87% ] 0553/1000 VUs  2m36.8s/3m00.0s

running (2m37.8s), 0536/1000 VUs, 5292 complete and 0 interrupted iterations
default   [  88% ] 0536/1000 VUs  2m37.8s/3m00.0s

running (2m38.8s), 0512/1000 VUs, 5343 complete and 0 interrupted iterations
default   [  88% ] 0512/1000 VUs  2m38.8s/3m00.0s

running (2m39.8s), 0486/1000 VUs, 5402 complete and 0 interrupted iterations
default   [  89% ] 0486/1000 VUs  2m39.8s/3m00.0s

running (2m40.8s), 0470/1000 VUs, 5445 complete and 0 interrupted iterations
default   [  89% ] 0470/1000 VUs  2m40.8s/3m00.0s

running (2m41.8s), 0451/1000 VUs, 5491 complete and 0 interrupted iterations
default   [  90% ] 0451/1000 VUs  2m41.8s/3m00.0s

running (2m42.8s), 0432/1000 VUs, 5534 complete and 0 interrupted iterations
default   [  90% ] 0432/1000 VUs  2m42.8s/3m00.0s

running (2m43.8s), 0413/1000 VUs, 5572 complete and 0 interrupted iterations
default   [  91% ] 0413/1000 VUs  2m43.8s/3m00.0s

running (2m44.8s), 0389/1000 VUs, 5616 complete and 1 interrupted iterations
default   [  92% ] 0389/1000 VUs  2m44.8s/3m00.0s

running (2m45.8s), 0367/1000 VUs, 5661 complete and 1 interrupted iterations
default   [  92% ] 0367/1000 VUs  2m45.8s/3m00.0s

running (2m46.8s), 0337/1000 VUs, 5712 complete and 1 interrupted iterations
default   [  93% ] 0337/1000 VUs  2m46.8s/3m00.0s

running (2m47.8s), 0321/1000 VUs, 5751 complete and 1 interrupted iterations
default   [  93% ] 0321/1000 VUs  2m47.8s/3m00.0s

running (2m48.8s), 0300/1000 VUs, 5786 complete and 1 interrupted iterations
default   [  94% ] 0300/1000 VUs  2m48.8s/3m00.0s

running (2m49.8s), 0284/1000 VUs, 5822 complete and 1 interrupted iterations
default   [  94% ] 0284/1000 VUs  2m49.8s/3m00.0s

running (2m50.8s), 0258/1000 VUs, 5880 complete and 1 interrupted iterations
default   [  95% ] 0258/1000 VUs  2m50.8s/3m00.0s

running (2m51.8s), 0226/1000 VUs, 5934 complete and 1 interrupted iterations
default   [  95% ] 0226/1000 VUs  2m51.8s/3m00.0s

running (2m52.8s), 0196/1000 VUs, 5988 complete and 1 interrupted iterations
default   [  96% ] 0196/1000 VUs  2m52.8s/3m00.0s

running (2m53.8s), 0169/1000 VUs, 6040 complete and 1 interrupted iterations
default   [  97% ] 0169/1000 VUs  2m53.8s/3m00.0s

running (2m54.8s), 0145/1000 VUs, 6090 complete and 1 interrupted iterations
default   [  97% ] 0145/1000 VUs  2m54.8s/3m00.0s

running (2m55.8s), 0128/1000 VUs, 6131 complete and 1 interrupted iterations
default   [  98% ] 0128/1000 VUs  2m55.8s/3m00.0s

running (2m56.8s), 0115/1000 VUs, 6157 complete and 1 interrupted iterations
default   [  98% ] 0115/1000 VUs  2m56.8s/3m00.0s

running (2m57.8s), 0086/1000 VUs, 6206 complete and 1 interrupted iterations
default   [  99% ] 0086/1000 VUs  2m57.8s/3m00.0s

running (2m58.8s), 0060/1000 VUs, 6244 complete and 1 interrupted iterations
default   [  99% ] 0060/1000 VUs  2m58.8s/3m00.0s

running (2m59.8s), 0023/1000 VUs, 6293 complete and 1 interrupted iterations
default   [ 100% ] 0023/1000 VUs  2m59.8s/3m00.0s

running (3m00.8s), 0003/1000 VUs, 6313 complete and 1 interrupted iterations
default ↓ [ 100% ] 0013/1000 VUs  3m0s


  █ TOTAL RESULTS 

    checks_total.......................: 21057   116.350318/s
    checks_succeeded...................: 100.00% 21057 out of 21057
    checks_failed......................: 0.00%   0 out of 21057

    ✓ event info status is 200
    ✓ order creation status is 200
    ✓ order state status is 200
    ✓ ticket update status
    ✓ updated order state status is 200
    ✓ repeat prepare order status

    HTTP
    http_req_duration.......................................................: avg=5.89s min=29.93ms med=6.14s  max=36.88s p(90)=9.4s  p(95)=10.16s
      { expected_response:true }............................................: avg=5.91s min=29.93ms med=6.15s  max=36.88s p(90)=9.41s p(95)=10.16s
    http_req_failed.........................................................: 0.52%  111 out of 21057
    http_reqs...............................................................: 21057  116.350318/s

    EXECUTION
    iteration_duration......................................................: avg=20.3s min=83.83ms med=19.03s max=56.24s p(90)=35.6s p(95)=37.63s
    iterations..............................................................: 6316   34.899017/s
    vus.....................................................................: 3      min=3            max=1000
    vus_max.................................................................: 1000   min=1000         max=1000

    NETWORK
    data_received...........................................................: 86 MB  477 kB/s
    data_sent...............................................................: 2.7 MB 15 kB/s



running (3m01.0s), 0000/1000 VUs, 6316 complete and 1 interrupted iterations
default ✓ [ 100% ] 0000/1000 VUs  3m0s